#!/bin/bash

# модификация: добавени проверки (04-04-2026)

if [[ "${#}" -ne 2 ]]; then
	echo "Amount of parameters incorrect!" >&2
	exit 1
fi

if [[ ! -f "${1}" ]]; then
	echo "${1} is not an Antlrfile!" >&2
	exit 2
fi

if [[ ! -f "${2}" ]]; then
	echo "${2} is not a proper file!" >&2
	exit 3
fi

antlrfile="${1}"
input_file="${2}"

# от входния файл взимаме базовото име без разширението, тъй като в условието се изисква за всеки ред да сглабяме изходната директория по следния начин: <базова изходна директория от реда>/<базово име на входния файл без разширение> 

# тук извличаме базовото име, като взимаме само текста до първата точка (приемаме за целите на задача че всичко след първата точка е разширение) 
base_input=$(basename "${2}" | cut -d '.' -f 1)

while read line; do

# Езикът е първата колона
lang=$(echo "${line}" | cut -d ' ' -f 1)

# Базовата изходна директория може да се счита че е втората колона след '
base_dir=$(echo "${line}" | cut -d "'" -f 2)

# Сглабяме новата директория
new_dir=$(echo "${base_dir}/${base_input}")

options=""

# модификация на regex-ите, тъй като искаме прецизно да обхванем всеки един от редовете на Antlrfile-а
# тоест, искаме да се уверим, че grep прихваща думите visitor|listener точно като желани типове изходни файлове, а не като например базова изходна директория
# регексът е разписан така че да прихваща целия ред плътно (и като бонус са добавени [ ]* елементи които да прихващат trailing whitespace-ове между отделните думи за всеки случай)
if echo "${line}" | grep -qE "^[ ]*${lang}[ ]+([^']*)visitor(.*)([^']*)+'(.*)'[ ]*\$"; then
    options="${options} -visitor"
fi

if echo "${line}" | grep -qvE "^[ ]*${lang}[ ]+([^']*)listener([^']*)[ ]+'(.*)'[ ]*\$"; then
    options="${options} -no-listener"
fi

# тъй като командата не е налична просто извикваме с echo за да се уверим че извикванията са правилно структурирани
echo "antlr4 -Dlanguage=${lang} ${options} -o ${new_dir} ${input_file}"

done < "${antlrfile}"
