#!/bin/bash

# проверки
if [[ "${#}" -ne 1 ]]; then
	echo "Invalid amount of params!" >&2
	exit 1
fi

if [[ ! -d "${1}" ]]; then
	echo "${1} is not a dir!" >&2
	exit 2
fi

DIR="${1}"

mkdir -p "${DIR}/.data"

while read filename; do

    hashed=$(sha256sum "${filename}" | cut -d ' ' -f 1)

    # ако съществува файл, за който вече има създаден хеш-файл в .data, само го премахваме (не презаписваме инстанцията)
    if [[ -f "${DIR}/.data/${hashed}" ]]; then
        rm "${filename}"
    else
    # ако за първи път се среща този хеш (няма такъв създаден хеш-файл в .data, преместваме оригиналното съдържание на файла в .datа с новото име)
        mv "${filename}" "${DIR}/.data/${hashed}"
    fi

    # на упражненията дискутирахме употребата на realpath и флага --relative-to
    # флага relative-to връща релативен път, който сочи към искания файл (в случая хеш файла), релативно спрямо файла който подадем след флага
    # тук има тънкост, че --relative-to флага очаква да се подаде директория (man realpath (1)), поради което ако подаден обикновен файл ще ни залепи още ниво (../) нагоре, и това чупи символната връзка
    # за да избегнем това, взимаме името на директорията, в която ще създаваме символната връзка и където преди се е намирал изтрития файл.
    # използвайки изцяло релативни пътища ние си гарантираме, че няма да се счупят символните връзки, независимо къде преместим базовата директория 
    relative_symlink=$(realpath "${DIR}/.data/${hashed}" --relative-to="$(dirname ${filename})") 
   ln -s "${relative_symlink}" "${filename}"

# претърсваме само тези файлове, които не се съдържат в .data директорията (ако има не-хеш файлове в .data директорията, по допълнително уточнение просто ги игнорираме). Тъй като търсим само обикновени файлове, при следващо извикване на скрипта върху същата директория съществуващите символни връзки ще бъдат игнорирани, което ни гарантира идемпотентност на скрипта.
done < <(find "${1}" -type f | grep -vE "^${DIR}/\.data")
